Repository: ornchannlyhov/rentalRoomManagement
Catalog: lib/l10n/app_*.arb
Languages: km

# receiptTab
source: Receipts
km: វិក្កយបត្រ

# historyTab
source: History
km: ទិន្នន័យចាស់

# buildingTab
source: Buildings
km: អគារ

# tenantTab
source: Tenants
km: អ្នកជួល

# settingsTab
source: Settings
km: ការកំណត់

source: Detailed Analysis
km: ការវិភាគលម្អិត

# moneyTab
source: Money
km: ប្រាក់

source: Change Room
km: ផ្លាស់ប្តូរបន្ទប់

source: View Details
km: មើលព័ត៌មានលម្អិត

source: Building
km: អគារ

source: Tenant Information
km: ព័ត៌មានអ្នកជួល

source: Male
km: បុរស

source: Female
km: នារី

source: Other
km: ផ្សេងៗ

source: Edit Receipt
km: កែប្រែវិក្កយបត្រ

source: Create New Receipt
km: បង្កើតវិក្កយបត្រថ្មី

# noBuildingsPrompt
source: No buildings. Please create a building before creating a receipt.
km: មិនមានអគារទេ។ សូមបង្កើតអគារមុននឹងបង្កើតវិក្កយបត្រ។

source: Create New Building
km: បង្កើតអគារថ្មី

source: Select Building
km: ជ្រើសរើសអគារ

source: All
km: ទាំងអស់

source: Select Room
km: ជ្រើសរើសបន្ទប់

source: No occupied rooms
km: មិនមានបន្ទប់ដែលមានអ្នកជួលទេ

# pleaseSelectRoom
source: Please select a room
km: សូមជ្រើសរើសបន្ទប់

source: Previous Month Usage
km: ការប្រើប្រាស់ខែមុន

source: Current Month Usage
km: ការប្រើប្រាស់ខែនេះ

# waterM3
source: Water (m³)
km: ទឹក (m³)

source: Electricity (kWh)
km: ភ្លើង (kWh)

source: Services
km: សេវា

source: Unknown
km: មិនស្គាល់

# selectBuildingFirst
source: Please select a building first
km: សូមជ្រើសរើសអគារមុនសិន

# noServicesForBuilding
source: No services available for this building
km: មិនមានសេវាកម្មសម្រាប់អគារនេះទេ

source: Error loading services
km: មានបញ្ហាក្នុងការផ្ទុកសេវាកម្ម

source: Save
km: រក្សាទុក

source: Error loading buildings
km: មានបញ្ហាក្នុងការទាញយកអគារ

# receiptDetailTitle
source: Receipt Details
km: វិក្កយបត្របន្ទប់ជួល

source: Share Receipt
km: ចែករំលែកវិក្កយបត្រ

# receiptForRoom
source: Receipt for Room {room}
km: វិក្កយបត្របន្ទប់ {room}

# tenantInfo
source: Tenant Information
km: ព័ត៌មានអ្នកជួល

source: Tenant: {name}
km: ម្ចាស់បន្ទប់៖ {name}

source: Phone Number
km: លេខទូរស័ព្ទ

source: Utility Usage
km: ការប្រើប្រាស់

source: Water (Previous Month)
km: ទឹកប្រើប្រាស់ខែមុន

source: Water (Current Month)
km: ទឹកប្រើប្រាស់ខែនេះ

# electricPreviousMonth
source: Electricity (Previous Month)
km: ភ្លើងប្រើប្រាស់ខែមុន

# electricCurrentMonth
source: Electricity (Current Month)
km: ភ្លើងប្រើប្រាស់ខែនេះ

source: Payment Breakdown
km: ទូទាត់ការប្រើប្រាស់

source: Water Usage
km: ទឹកប្រើប្រាស់

source: Total Water Price
km: ថ្លៃទឹកសរុប

# electricUsage
source: Electricity Usage
km: ភ្លើងប្រើប្រាស់

# totalElectricPrice
source: Total Electricity Price
km: ថ្លៃភ្លើងសរុប

source: Additional Services
km: សេវាកម្មបន្ថែម

source: Total Service Price
km: សរុបសេវាកម្ម

source: Room Rent
km: ថ្លៃជួលបន្ទប់

source: Grand Total
km: សរុបទឹកប្រាក់

# currencyServiceUnavailable
source: Currency service unavailable – showing base USD rate
km: សេវាប្រាក់ប្តូរមានបញ្ហា - កំពុងបង្ហាញអត្រាមូលដ្ឋាន USD ជំនួសវិញ

source: Thank you for using our service!
km: សូមអរគុណសម្រាប់ការប្រើប្រាស់សេវាកម្មរបស់យើងខ្ញុំ!

# currencyConversionFailed
source: Failed to convert currency
km: បរាជ័យក្នុងការប្តូរប្រាក់

source: Buildings
km: អគារ

source: Search buildings...
km: ស្វែងរកអគារ...

source: No buildings found
km: រកមិនឃើញអគារ

source: No buildings available
km: មិនមានអគារ

# tryDifferentKeywords
source: Try searching with different keywords
km: សូមព្យាយាមស្វែងរកជាមួយពាក្យគន្លឹះផ្សេង

# tapPlusToAddBuilding
source: Tap + to add a new building
km: សូមចុចប៊ូតុង + ដើម្បីបន្ថែមអគារថ្មី

source: Loading...
km: កំពុងដំណើរការ...

source: Error loading data
km: មានបញ្ហាក្នុងការផ្ទុកទិន្នន័យ

source: Try Again
km: ព្យាយាមម្តងទៀត

source: Confirm Delete
km: បញ្ជាក់ការលុប

# deleteBuildingConfirmMsg
source: Are you sure you want to delete building "{name}"?
km: តើអ្នកពិតជាចង់លុបអគារ "{name}" មែនទេ?

source: Cancel
km: បោះបង់

source: Delete
km: លុប

source: Report
km: របាយការណ៍

# rentPricePerMonth
source: {price}$/ month
km: តម្លៃជួលប្រចាំខែ

# perMonth
source: / month
km: /ខែ

source: Electricity
km: អគ្គិសនី

source: Water
km: ទឹក

source: Edit
km: កែប្រែ

# buildingDeletedSuccess
source: Building "{name}" deleted successfully
km: បានលុបអគារ "{name}" ជោគជ័យ

# buildingDeleted
source: Building "{name}" deleted
km: អគារ {building} ត្រូវបានលុបដោយជោគជ័យ

# buildingDeleteFailed
source: Failed to delete building: {error}
km: បរាជ័យក្នុងការលុបអគារ: {error}

# shareReceiptFailed
source: Failed to share receipt
km: មានបញ្ហាក្នុងការចែករំលែក

source: Contact Information
km: ព័ត៌មានទំនាក់ទំនង

source: Room Information
km: ព័ត៌មានបន្ទប់

# notAvailable
source: N/A
km: មិនមាន

source: Rental Price
km: ថ្លៃជួល

source: Edit Tenant
km: កែប្រែអ្នកជួល

source: Create New Tenant
km: បង្កើតអ្នកជួលថ្មី

source: Please enter tenant name
km: សូមបញ្ចូលឈ្មោះអ្នកជួល

source: Please enter phone number
km: សូមបញ្ចូលលេខទូរស័ព្ទ

source: Invalid phone number
km: លេខទូរស័ព្ទមិនត្រឹមត្រូវ

source: Search country
km: ស្វែងរកប្រទេស

source: Gender
km: ភេទ

source: Reports
km: របាយការណ៍

source: Add Report
km: បន្ថែមរបាយការណ៍

source: Edit Report
km: កែសម្រួលរបាយការណ៍

source: Delete Report
km: លុបរបាយការណ៍

source: No Reports
km: គ្មានរបាយការណ៍

# reportAddedSuccess
source: Report added successfully
km: បានបន្ថែមរបាយការណ៍ដោយជោគជ័យ

# reportUpdatedSuccess
source: Report updated successfully
km: បានកែសម្រួលរបាយការណ៍ដោយជោគជ័យ

# reportDeletedSuccess
source: Report deleted successfully
km: បានលុបរបាយការណ៍ដោយជោគជ័យ

# deleteReportConfirm
source: Are you sure you want to delete this report?
km: តើអ្នកពិតជាចង់លុបរបាយការណ៍នេះមែនទេ?

# selectTenant
source: Please select a tenant
km: សូមជ្រើសរើសអ្នកជួល

source: Problem Description
km: ការពិពណ៌នាបញ្ហា

# enterProblemDescription
source: Please enter a problem description
km: សូមបញ្ចូលការពិពណ៌នាបញ្ហា

source: No Tenant
km: គ្មានអ្នកជួល

source: Optional
km: ស្រេចចិត្ត

# reportStatusPending
source: Pending
km: កំពុងរងចាំ

# reportStatusInProgress
source: In Progress
km: កំពុងដំណើរការ

# reportStatusResolved
source: Resolved
km: បានដោះស្រាយ

# reportStatusClosed
source: Closed
km: បានបិទ

source: Notes
km: កំណត់ចំណាំ

# priorityLabel
source: Priority
km: អាទិភាព

source: Change Status
km: ប្តូរស្ថានភាព

source: Filter by Status
km: ច្រោះតាមស្ថានភាព

source: All Reports
km: របាយការណ៍ទាំងអស់

source: Unknown Tenant
km: អ្នកជួលមិនស្គាល់

# reportStatusUpdated
source: Report status updated to {status}
km: ស្ថានភាពរបាយការណ៍បានធ្វើបច្ចុប្បន្នភាពទៅ {status}

# reportStatusUpdateFailed
source: Failed to update report status
km: បរាជ័យក្នុងការធ្វើបច្ចុប្បន្នភាពស្ថានភាពរបាយការណ៍

# noFilteredReports
source: No {status} Reports
km: គ្មានរបាយការណ៍ {status}

# noFilteredReportsSubtitle
source: No reports match the selected status filter
km: គ្មានរបាយការណ៍ត្រូវគ្នានឹងតម្រងស្ថានភាពដែលបានជ្រើសរើស

source: Clear Filter
km: លុបតម្រង

# deleteReportConfirmFrom
source: Are you sure you want to delete this report from {tenant}?
km: តើអ្នកប្រាកដថាចង់លុបរបាយការណ៍នេះពី {tenant} ទេ?

# reportPriorityUrgent
source: Urgent
km: បន្ទាន់

# deleteBuildingWarning
source: Are you sure you want to delete {name}? This will also delete all rooms, services, and associated data.
km: តើអ្នកប្រាកដថាចង់លុប {name} ទេ? នេះនឹងលុបបន្ទប់ សេវាកម្ម និងទិន្នន័យទាក់ទងទាំងអស់។

# noRoomsSubtitle
source: Pull to refresh or add a new room
km: អូសចុះដើម្បីផ្ទុកឡើងវិញ ឬបន្ថែមបន្ទប់ថ្មី

# noServicesSubtitle
source: Pull to refresh or add a new service
km: អូសចុះដើម្បីផ្ទុកឡើងវិញ ឬបន្ថែមសេវាកម្មថ្មី

# noReportsSubtitle
source: Pull to refresh
km: អូសចុះដើម្បីផ្ទុកឡើងវិញ

source: refresh
km: ធ្វើឱ្យស្រស់

source: status
km: ស្ថានភាព

# reportPriorityLow
source: Low
km: ទាប

# reportPriorityMedium
source: Medium
km: មធ្យម

# reportPriorityHigh
source: High
km: ខ្ពស់

# reportLanguageEnglish
source: English
km: អង់គ្លេស

# reportLanguageKhmer
source: Khmer
km: ខ្មែរ

source: Update Tenant
km: កែប្រអ្នកជួល

source: Create Tenant
km: បង្កើតអ្នកជួល

source: Error loading rooms
km: មានបញ្ហាក្នុងការផ្ទុកបន្ទប់

# deleteTenantConfirmMsg
source: Are you sure you want to delete tenant {tenant}?
km: តើអ្នកពិតជាចង់លុបអ្នកជួល {tenant} មែនទេ?

source: Rooms
km: បន្ទប់

source: Add Room
km: បន្ថែមបន្ទប់

source: Add Service
km: បញ្ចូលសេវា

source: No Rooms
km: គ្មានបន្ទប់

source: No Services
km: គ្មានសេវា

# pullToRefresh
source: Pull down to refresh
km: ទាញចុះដើម្បីផ្ទុកទិន្នន័យឡើងវិញ

# roomAddedSuccess
source: Room "{number}" added successfully
km: បន្ថែមបន្ទប់ "{number}" ដោយជោគជ័យ

# roomUpdatedSuccess
source: Room "{number}" updated successfully
km: កែប្រែបន្ទប់ "{number}" ដោយជោគជ័យ

# roomDeletedSuccess
source: Room "{number}" deleted successfully
km: បានលុបបន្ទប់ "{number}" ជោគជ័យ

# serviceAddedSuccess
source: Service "{name}" added successfully
km: បន្ថែមសេវា "{name}" ដោយជោគជ័យ

# serviceUpdatedSuccess
source: Service "{name}" updated successfully
km: កែប្រែសេវា "{name}" ដោយជោគជ័យ

# serviceDeletedSuccess
source: Service "{name}" deleted successfully
km: បានលុបសេវា "{name}" ជោគជ័យ

# buildingUpdatedSuccess
source: Building "{name}" updated successfully
km: កែប្រែអគារ "{name}" ដោយជោគជ័យ

source: Delete Building
km: លុបអគារ

# deleteBuildingConfirm
source: Do you want to delete building "{name}"?
km: តើអ្នកចង់លុបអគារ "{name}"?

source: Delete Room
km: លុបបន្ទប់

# deleteRoomConfirm
source: Do you want to delete room "{number}"?
km: តើអ្នកចង់លុបបន្ទប់ "{number}"?

source: Delete Service
km: លុបសេវា

# deleteServiceConfirm
source: Do you want to delete service "{name}"?
km: តើអ្នកចង់លុបសេវា "{name}"?

# errorOccurred
source: An error occurred
km: មានកំហុស

source: Add New Building
km: បញ្ចូលអគារថ្មី

source: Edit Building
km: កែប្រែអគារ

source: Building Name
km: ឈ្មោះអគារ

# buildingNameRequired
source: Please enter building name.
km: សូមបញ្ចូលឈ្មោះអគារ។

# roomCount
source: Number of Rooms
km: ចំនួនបន្ទប់

# currentRoomCount
source: Current Number of Rooms
km: ចំនួនបន្ទប់បច្ចុប្បន្ន

# roomCountRequired
source: Please enter number of rooms.
km: សូមបញ្ចូលចំនួនបន្ទប់។

# roomCountInvalid
source: Please enter a valid number of rooms.
km: សូមបញ្ចូលចំនួនបន្ទប់ត្រឹមត្រូវ។

# roomCountEditNote
source: Room count cannot be changed. Manage rooms individually.
km: ចំនួនបន្ទប់មិនអាចកែប្រែបានទេ។ សូមគ្រប់គ្រងបន្ទប់នីមួយៗដាច់ដោយឡែក។

# electricPricePerKwh
source: Electricity Price (1 kWh)
km: តម្លៃអគ្គិសនី (1kWh)

# waterPricePerCubicMeter
source: Water Price (1 m³)
km: តម្លៃទឹក (1m³)

source: Save Changes
km: រក្សាទុកការកែប្រែ

source: Save Building
km: រក្សាទុកអគារ

source: No tenants
km: មិនមានអ្នកជួល

# tapToAddNewTenant
source: Tap + to add a new tenant
km: សូមចុចប៊ូតុង + ដើម្បីបន្ថែមអ្នកជួលថ្មី

source: Room Number
km: បន្ទប់ {number}

# tenantNameLabel
source: Name
km: ឈ្មោះ

# roomStatus
source: Status: {status}
km: ស្ថានភាព: {status}

# rentPrice
source: Rent Price: {price}$
km: តម្លៃជួល៖ {price}$

source: No Room
km: មិនមានបន្ទប់

# servicePriceLabel
source: Service Price
km: តម្លៃសេវា

source: Unknown Room
km: មិនស្គាល់បន្ទប់

# roomNumberLabel
source: Room {number}
km: បន្ទប់ {number}

# rentPricePerMonthLabel
source: Monthly Rent Price
km: តម្លៃជួលប្រចាំខែ

# buildingAnalysisTab
source: Building
km: អគារ

source: Available
km: ទំនេរ

source: Rented
km: មានអ្នកជួល

# servicePrice
source: {price}$
km: តម្លៃសេវា: {price}$

source: Welcome Back
km: សូមស្វាគមន័យការត្រឡប់មកវិញ

# signInPrompt
source: Sign in to your account
km: ចូលទៅក្នុងគណនីរបស់អ្នក

# emailLabel
source: Email
km: អ៊ីមែល

# rentPriceLabel
source: Monthly Rent Price
km: តម្លៃជួលប្រចាំខែ

source: Edit Service
km: កែប្រែសេវា

source: Create New Service
km: បង្កើតសេវាថ្មី

source: Service Name
km: ឈ្មោះសេវា

# serviceNameRequired
source: Please enter service name
km: សូមបញ្ចូលឈ្មោះសេវា

# priceValue
source: Price: {price}$
km: តម្លៃ: {price}$

# emailHint
source: Enter your email
km: បញ្ចូលអ៊ីមែលរបស់អ្នក

# passwordLabel
source: Password
km: ពាក្យសម្ងាត់

# passwordHint
source: Enter your password
km: បញ្ចូលពាក្យសម្ងាត់របស់អ្នក

# loginButton
source: Login
km: ចូលប្រើ

# noAccount
source: Don't have an account?
km: មិនមានគណនីទេ?

# registerLink
source: Register
km: ចុះឈ្មោះ

source: Create Account
km: បង្កើតគណនីថ្មី

# signUpPrompt
source: Sign up to get started
km: ចុះឈ្មោះដើម្បីចាប់ផ្តើមប្រើប្រាស់

# fullNameLabel
source: Full Name
km: ឈ្មោះពេញ

# fullNameHint
source: Enter your full name
km: បញ្ចូលឈ្មោះពេញរបស់អ្នក

# registerButton
source: Register
km: ចុះឈ្មោះ

# haveAccount
source: Already have an account?
km: មានគណនីរួចហើយ?

# loginLink
source: Login
km: ចូលប្រើ

# buildingsTitle
source: Buildings
km: អគារ

# paidStatus
source: Paid
km: បានបង់ប្រាក់

# pendingStatus
source: Pending
km: មិនទាន់បង់ប្រាក់

# overdueStatus
source: Overdue
km: ហួសកំណត់

source: Room
km: បន្ទប់

source: changed to
km: បានផ្លាស់ប្តូរទៅជា

# searchBuildingHint
source: Search building...
km: ស្វែងរកអគារ...

# deleteConfirmMsg
source: Are you sure you want to delete building {building}?
km: តើអ្នកពិតជាចង់លុបអគារ {building} មែនទេ?

# deleteFailed
source: Failed to delete building: {error}
km: បរាជ័យក្នុងការលុបអគារ: {error}

source: Add Receipt
km: បន្ថែមវិក្កយបត្រ

# deleteReceiptConfirmMsg
source: Are you sure you want to delete the receipt for room {room}?
km: តើអ្នកប្រាកដជាចង់លុបវិក្កយបត្រសម្រាប់បន្ទប់ {room} មែនទេ?

# receiptDeletedRoom
source: Receipt for room {room} deleted
km: បានលុបវិក្កយបត្របន្ទប់ {room}

source: Receipt not found
km: រកមិនឃើញវិក្កយបត្រ

source: No buildings
km: មិនមានអគារ

# noBuildingsSearch
source: No buildings found
km: រកមិនឃើញអគារ

# addNewBuildingHint
source: Tap + to add a new building
km: សូមចុចប៊ូតុង + ដើម្បីបន្ថែមអគារថ្មី

# tryDifferentKeyword
source: Try a different keyword
km: សូមព្យាយាមប្រើពាក្យគន្លឹះផ្សេងទៀត

# oldDataTitle
source: History
km: ទិន្នន័យចាស់

# searchReceiptHint
source: Search receipts...
km: ស្វែងរកវិក្កយបត្រ...

# viewDetail
source: View Details
km: មើលលម្អិត

source: Share
km: ចែករំលែក

# deleteOption
source: Delete
km: លុប

source: Undo
km: មិនធ្វើវិញ

# receiptTitle
source: Receipts
km: វិក្កយបត្រ

source: No receipts
km: មិនមានវិក្កយបត្រ

# settingsTitle
source: Settings
km: ការកំណត់

source: Settings
km: ការកំណត់

source: Account Settings
km: ការកំណត់គណនី

# accountSettingsSubtitle
source: Privacy, security, change password
km: ឯកជនភាព, សុវត្ថិភាព, ប្តូរពាក្យសម្ងាត់

# privacySecurity
source: Privacy, security, change password
km: ភាពឯកជន សុវត្ថិភាព និងការផ្លាស់ប្តូរពាក្យសម្ងាត់

source: Subscriptions
km: ការជាវសេវាកម្ម

# subscriptionsSubtitle
source: Plans, payment methods
km: គម្រោង, វិធីសាស្រ្តទូទាត់

# plansPayments
source: Plans, payment methods
km: គម្រោង និងវិធីទូទាត់ប្រាក់

source: Appearance
km: រូបរាង

source: Dark mode
km: Theme ងងឹត

source: Light mode
km: Theme ភ្លឺ

source: System default
km: លំនាំដើមប្រព័ន្ធ

source: Language
km: ភាសា

source: Khmer
km: ខ្មែរ

source: Chinese
km: ចិន

# helpAndSupport
source: Help & Support
km: ជំនួយ

# helpAndSupportSubtitle
source: FAQs, contact us
km: សំណួរញឹកញាប់ និងទំនាក់ទំនងមកយើង

# faqContact
source: FAQs, contact us
km: សំណួរញឹកញាប់ និងទំនាក់ទំនងមកយើង

source: About
km: អំពីកម្មវិធី

# receiptDeleted
source: Receipt deleted successfully
km: បានលុបវិក្កយបត្រដោយជោគជ័យ

# receiptRestored
source: Receipt restored successfully
km: បានស្ដារវិក្កយបត្រដោយជោគជ័យ

source: No receipts for {month}
km: មិនមានវិក្កយបត្រសម្រាប់ខែ {month}

source: Menu
km: ម៉ឺនុយ

source: Due Date
km: កាលបរិច្ឆេទផុតកំណត់

# noReceiptsForBuilding
source: No receipts for this building
km: មិនមានវិក្កយបត្រសម្រាប់អគារនេះ

# noSearchResults
source: No search results for "{query}"
km: មិនមានលទ្ធផលស្វែងរកសម្រាប់ "{query}"

# receiptStatusChanged
source: Receipt status changed to {status}
km: ស្ថានភាពវិក្កយបត្របានផ្លាស់ប្តូរទៅជា {status}

# version
source: Version {versionNumber}
km: ជំនាន់ {versionNumber}

source: Sign Out
km: ចាកចេញ

# signOutConfirm
source: Are you sure you want to sign out?
km: តើអ្នកពិតជាចង់ចេញពីប្រព័ន្ធមែនទេ?

# signOutConfirmation
source: Are you sure you want to sign out?
km: តើអ្នកប្រាកដថាចង់ចាកចេញ?

source: Select Language
km: ជ្រើសរើសភាសា

source: Premium Member
km: សមាជិក Premium

# tenantsTitle
source: Tenants
km: អ្នកជួល

# searchTenantHint
source: Search tenant...
km: ស្វែងរកអ្នកជួល...

# tenantAdded
source: Tenant {tenant} added successfully
km: បានបន្ថែមអ្នកជួល {tenant} ដោយជោគជ័យ

# tenantAddFailed
source: Error adding tenant
km: បរាជ័យក្នុងការបន្ថែមអ្នកជួល

# tenantUpdated
source: Tenant {tenant} updated successfully
km: បានកែប្រែព័ត៌មានអ្នកជួល {tenant} ដោយជោគជ័យ

# tenantUpdateFailed
source: Error updating tenant
km: បរាជ័យក្នុងការកែប្រែព័ត៌មាន

# tenantDeleted
source: Tenant {tenant} deleted
km: បានលុបអ្នកជួល {tenant}

# tenantDeleteFailed
source: Error deleting tenant
km: បរាជ័យក្នុងការលុបអ្នកជួល

# roomChanged
source: Room for {tenant} changed to {room}
km: បានផ្លាស់ប្តូរបន្ទប់សម្រាប់ {tenant} ទៅបន្ទប់ {room}

# roomChangeFailed
source: Error undoing room change
km: មានបញ្ហាក្នុងការផ្លាស់ប្តូរបន្ទប់

source: Retry Loading Profile
km: ព្យាយាមម្តងទៀត

source: Failed to load profile.
km: ការទាញយកព័ត៌មាន Profile បានបរាជ័យ

# noLoggedIn
source: You are not logged in.
km: អ្នកមិនទាន់បានចូលគណនីទេ។

# notLoggedIn
source: You are not logged in.
km: អ្នកមិនទាន់បានចូលគណនីទេ។

source: Go to Onboarding
km: ទៅកាន់ទំព័រណែនាំប្រើប្រាស់

source: Unknown User
km: អ្នកប្រើប្រាស់មិនស្គាល់

source: No Email Provided
km: គ្មានអ៊ីមែល

source: Edit profile tapped
km: បានចុចកែប្រែប្រវត្តិ

# signOutSuccess
source: Signed out successfully!
km: ចេញពីប្រព័ន្ធដោយជោគជ័យ!

# signOutFailed
source: Failed to sign out
km: បរាជ័យក្នុងការចេញពីប្រព័ន្ធ

# confirmPasswordLabel
source: Confirm Password
km: បញ្ជាក់ពាក្យសម្ងាត់

# confirmPasswordHint
source: Confirm your password
km: បញ្ចាក់ពាក្យសម្ងាត់របស់អ្នក

# manageBuildings
source: Manage Buildings & Rooms
km: គ្រប់គ្រងអគារ និងបន្ទប់

# manageBuildingsDesc
source: Manage your buildings, rooms, and services easily with our intuitive interface.
km: គ្រប់គ្រងអគារ បន្ទប់ និងសេវាកម្មរបស់អ្នកយ៉ាងងាយស្រួលជាមួយផ្ទាំងគ្រប់គ្រងរបស់យើង។

source: Tenant Management
km: ការគ្រប់គ្រងអ្នកជួល

# tenantManagementDesc
source: Assign tenants and automate receipts with just a few taps.
km: ចាត់ចែងអ្នកជួល និងបង្កើតវិក្កយបត្រស្វ័យប្រវត្តិបានយ៉ាងងាយស្រួល។

source: Payment Tracking
km: ការតាមដានការទូទាត់ប្រាក់

# paymentTrackingDesc
source: Track payments easily - Pending, Paid, and Overdue status at a glance.
km: តាមដានស្ថានភាពការទូទាត់បានយ៉ាងងាយស្រួល - រង់ចាំ បង់រួច និងហួសកំណត់។

source: Automation Tools
km: ឧបករណ៍ស្វ័យប្រវត្តិ

# automationToolsDesc
source: Automate work with Telegram bot reminders and utilities input.
km: ធ្វើឱ្យការងារស្វ័យប្រវត្តិជាមួយការរំលឹកតាម Telegram និងការបញ្ចូលឧបករណ៍ជាច្រើន។

source: Advanced Analysis
km: ការវិភាគកម្រិតខ្ពស់

source: Financial
km: ហិរញ្ញវត្ថុ

source: Error loading currency rate
km: មានបញ្ហាក្នុងការទាញយកអត្រាប្តូរប្រាក់

source: January
km: មករា

source: February
km: កុម្ភៈ

source: March
km: មីនា

source: April
km: មេសា

source: May
km: ឧសភា

source: June
km: មិថុនា

source: July
km: កក្កដា

source: August
km: សីហា

source: September
km: កញ្ញា

source: October
km: តុលា

source: November
km: វិច្ឆិកា

source: December
km: ធ្នូ

source: Or Sign Out
km: ឬ ចាកចេញ

# pleaseEnterValue
source: Please enter a value
km: សូមបញ្ចូលតម្លៃ

# pleaseEnterValidNumber
source: Please enter a valid number
km: សូមបញ្ចូលលេខត្រឹមត្រូវ

# receiptsCount
source: {count,plural, =1{{count} receipt}other{{count} receipts}}
km: {count} វិក្កយបត្រ

source: Total Revenue
km: ប្រាក់ចំណូលសរុប

source: Paid
km: បានបង់ប្រាក់

source: Remaining
km: នៅសល់

# collectionRate
source: Collection Rate: {rate}%
km: អត្រាប្រមូល: {rate}%

source: Tap to see details
km: ចុចដើម្បីមើលលម្អិត

source: Utility Analysis
km: ការវិភាគតម្លៃ

source: Pending
km: មិនទាន់បង់

source: Overdue
km: ហួសកំណត់

source: Select Month
km: ជ្រើសរើសខែ

source: Year:
km: ឆ្នាំ:

source: Month:
km: ខែ:

source: Previous Month
km: ខែមុន

source: Next Month
km: ខែបន្ទាប់

source: Service
km: សេវាកម្ម

# emailValidationInvalid
source: Please enter a valid email
km: សូមបញ្ចូលអ៊ីមែលដែលត្រឹមត្រូវ

# passwordValidationLength
source: Password must be at least 6 characters
km: ពាក្យសម្ងាត់ត្រូវមានយ៉ាងហោចណាស់ 6 តួអក្សរ

source: Passwords do not match
km: ពាក្យសម្ងាត់មិនតរងគ្នាទេ

# chooseLanguageTitle
source: Choose Your Language
km: ជ្រើសរើសភាសារបស់អ្នក

# chooseLanguageSubtitle
source: Select your preferred language
km: ជ្រើសរើសភាសាដែលអ្នកចូលចិត្ត

# continueButton
source: Continue
km: បន្ត

# nextButton
source: Next
km: បន្ទាប់

source: Notification removed
km: បានលុបការជូនដំណឹង

# notificationsCleared
source: All notifications cleared
km: បានលុបការជូនដំណឹងទាំងអស់

source: No notifications
km: មិនមានការជូនដំណឹងទេ

# newReceiptNotification
source: New receipt notifications will appear here
km: ការជូនដំណឹងអំពីបង្កាន់ដៃថ្មីនឹងបង្ហាញនៅទីនេះ

source: Clear all notifications?
km: លុបការជូនដំណឹងទាំងអស់មែនទេ?

# clearNotificationsMessage
source: This will remove all notification items. You can still view receipts in the Receipts tab.
km: ការរើសលុបនេះនឹងលុបការជូនដំណឹងទាំងអស់។ អ្នកនៅតែអាចមើលបង្កាន់ដៃនៅផ្ទាំងបង្កាន់ដៃបាន។
